<a href="https://colab.research.google.com/github/IbazanS/Platzi/blob/main/Curso_de_Manipulaci%C3%B3n_y_An%C3%A1lisis_de_datos_con_Pandas_y_Python_Clase_3_ipynb_ipynb.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**De paneles de datos al DataFrame**

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
pd.__version__

'1.1.5'

**Diccionario:** estructura de información que almacena información en una estructura de llaves.

In [ ]:
dict_data = {'CO': 100, 'MX': 400, 'CH': 200}
dict_data

{'CH': 200, 'CO': 100, 'MX': 400}

In [ ]:
#se puede transfrmar en serie
pd.Series(dict_data)

CO    100
MX    400
CH    200
dtype: int64

In [ ]:
#Podemos crear objetvios más complejos con data frame
dict_data = {'CO': [100, 200, 800], 'MX': [400, 500,900], 'CH': [200, 100, 300]}
dict_data

{'CH': [200, 100, 300], 'CO': [100, 200, 800], 'MX': [400, 500, 900]}

In [ ]:
#Transformamos el dict en DF con
df = pd.DataFrame(dict_data)

In [ ]:
df

    CO   MX   CH
0  100  400  200
1  200  500  100
2  800  900  300

In [ ]:
dict_data = {
    'edad':[10, 9, 13, 14, 12, 11, 12],
    'cm': [115, 110, 130, 155, 125, 120, 125],
    'pais':['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1': [5, 10, 8, np.nan, 7, 8, 3],
    'Q2': [7, 9,9,8,8,8,9]
}
dict_data

{'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'edad': [10, 9, 13, 14, 12, 11, 12],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch']}

In [ ]:
df=pd.DataFrame(dict_data)

In [ ]:
df

   edad   cm pais genero    Q1  Q2
0    10  115   co      M   5.0   7
1     9  110   mx      F  10.0   9
2    13  130   co      F   8.0   9
3    14  155   mx      M   NaN   8
4    12  125   mx      M   7.0   8
5    11  120   ch      M   8.0   8
6    12  125   ch      F   3.0   9

In [ ]:
#En el dataframe se pueden definir indices:
df=pd.DataFrame(dict_data, index=['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'])
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

In [ ]:
#Ver propiedades
df.index #El indice está definido por los nombres de los estudiantes

Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')

In [ ]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [ ]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7],
       [9, 110, 'mx', 'F', 10.0, 9],
       [13, 130, 'co', 'F', 8.0, 9],
       [14, 155, 'mx', 'M', nan, 8],
       [12, 125, 'mx', 'M', 7.0, 8],
       [11, 120, 'ch', 'M', 8.0, 8],
       [12, 125, 'ch', 'F', 3.0, 9]], dtype=object)

In [ ]:
df['edad']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

In [ ]:
df[['edad', 'cm', 'Q1']]

          edad   cm    Q1
ana         10  115   5.0
benito       9  110  10.0
camilo      13  130   8.0
daniel      14  155   NaN
erika       12  125   7.0
fabian      11  120   8.0
gabriela    12  125   3.0

In [ ]:
df.loc['ana', ['edad', 'cm', 'Q1']] #con esta serie me da los datos de ana

edad     10
cm      115
Q1        5
Name: ana, dtype: object

In [ ]:
df.loc[['ana', 'erika'], ['edad', 'cm', 'Q1']]

       edad   cm   Q1
ana      10  115  5.0
erika    12  125  7.0

In [ ]:
df

          edad   cm pais genero    Q1  Q2
ana         10  115   co      M   5.0   7
benito       9  110   mx      F  10.0   9
camilo      13  130   co      F   8.0   9
daniel      14  155   mx      M   NaN   8
erika       12  125   mx      M   7.0   8
fabian      11  120   ch      M   8.0   8
gabriela    12  125   ch      F   3.0   9

In [ ]:
df.iloc[2, 1]

130

In [ ]:
#Con iloc también puedo seleccionar varios conjuntos de elementos
df.iloc[2, [1,3]]

cm        130
genero      F
Name: camilo, dtype: object

In [ ]:
df.iloc[[0,1],[2,3]]

       pais genero
ana      co      M
benito   mx      F

In [ ]:
#Filtro basado en condiciones
#Personas cuya edad > 12 año
df['edad']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: edad, dtype: int64

In [ ]:
df['edad'] >=12 #Verdadero: saisface la condición que le dije

ana         False
benito      False
camilo       True
daniel       True
erika        True
fabian      False
gabriela     True
Name: edad, dtype: bool

In [ ]:
df[(df['edad'] >=12) & (df['pais']=='mx')] #Para combinar varias condiciones debo separar con ()

        edad   cm pais genero   Q1  Q2
daniel    14  155   mx      M  NaN   8
erika     12  125   mx      M  7.0   8

In [ ]:
df.query('edad>12')

        edad   cm pais genero   Q1  Q2
camilo    13  130   co      F  8.0   9
daniel    14  155   mx      M  NaN   8

In [ ]:
df['Q2']>=df['Q1']

ana          True
benito      False
camilo       True
daniel      False
erika        True
fabian       True
gabriela     True
dtype: bool

In [ ]:
df[df['Q2']>=df['Q1']]

          edad   cm pais genero   Q1  Q2
ana         10  115   co      M  5.0   7
camilo      13  130   co      F  8.0   9
erika       12  125   mx      M  7.0   8
fabian      11  120   ch      M  8.0   8
gabriela    12  125   ch      F  3.0   9

***Listo!!***